<script>
  import Hero from '$lib/Home/Hero.svelte'
  import Features from '$lib/Home/Features.svelte'
</script>

<Hero />
<Features />

<section class="container py-8 grid gap-8">
	<div>
		<h2 class="font-semibold">مهندسی شده برای رشد و فروش بیش‌تر</h2>
		<p class="mt-2 text-sm leading-7">درگاه پرداخت آیدی‌پی, با اتصال هم‌زمان به درگاه‌های متنوع و معتبر بانکی(PSPها), کاربران را به سریع‌ترین و مطمئن‌ترین درگاه بانکی منتقل می‌کند و به واسطه‌ی قابلیت مسیردهی هوشمند, باعث افزایش درصد تراکنش‌های موفق می‌شود.</p>
		<div class="mt-4 flex gap-4">
			<a class="btn btn-brand text-xs" href="#">ساخت درگاه پرداخت</a>
			<a class="btn btn-light text-xs" href="#">بیشتر بدانید</a>
		</div>
	</div>

	<div>
		<h2 class="font-semibold">پرداخت در شبکه‌های اجتماعی</h2>
		<p class="mt-2 text-sm leading-7">آیدی‌لینک با مدیریت فرآیند فروش به روشی هوشمندانه و سریع, باعث افزایش فروش محصولات و خدمات, از طریق شبکه‌های اجتماعی مانند اینستاگرام, تلگرام یا وب‌سایت می‌شود.</p>
		<div class="mt-4 flex gap-4">
			<a class="btn btn-brand text-xs" href="#">ساخت آیدی‌لینک</a>
			<a class="btn btn-light text-xs" href="#">بیشتر بدانید</a>
		</div>
	</div>

	<div>
		<h2 class="font-semibold">طلایی‌ترین کارت بانکی</h2>
		<p class="mt-2 text-sm leading-7">آیدی‌کارت یک کارت بانکی عضو شبکه‌‌ی شتاب و متصل به یک حساب بانکی است که از تمام ویژگی‌‌ها و امکانات یک حساب بانکی تمام عیار برخوردار است. آیدی‌کارت این امکان را برای کاربران خود فراهم می‌‌سازد تا از تعرفه‌‌ی کارمزد کم‌‌تر در روزهای عادی و کارمزد رایگان در سه‌‌شنبه‌‌های طلاییِ آیدی‌پی بهره‌‌مند شوند.</p>
		<div class="mt-4 flex gap-4">
			<a class="btn btn-brand text-xs" href="#">درخواست آیدی‌کارت</a>
			<a class="btn btn-light text-xs" href="#">بیشتر بدانید</a>
		</div>
	</div>

	<div>
		<h2 class="font-semibold">درگاه پرداخت اشتراکی</h2>
		<p class="mt-2 text-sm leading-7">تسهیم بهترین روش برای مدیریت مالی کسب‌ و کارهای شراکتی است که به واسطه‌ی آن, درآمد حاصل از فروش محصولات یا خدمات, در سهم‌های ثابت یا متغیر میان شرکای تجاری تقسیم شده و به صورت جداگانه به حساب هر شخص واریز می‌‌شود.</p>
		<div class="mt-4 flex gap-4">
			<a class="btn btn-brand text-xs" href="#">درخواست فعال‌سازی تسهیم</a>
			<a class="btn btn-light text-xs" href="#">بیشتر بدانید</a>
		</div>
	</div>

	<div>
		<h2 class="font-semibold">فروشگاه اینترنتی بسازید</h2>
		<p class="mt-2 text-sm leading-7">اگر کالا یا خدمتی برای فروش دارید یا اگر فروشگاهی در اینستاگرام دارید با استفاده از آیدی‌پی می توانید <a class="link" href="#">فروشگاه اینترنتی</a> خود را بصورت رایگان و در کوتاه ترین زمان ممکن ایجاد کنید و برای هر کالا لینک پرداخت مستقیم بسازید.</p>
		<div class="mt-4 flex gap-4">
			<a class="btn btn-brand text-xs" href="#">ساخت فروشگاه</a>
			<a class="btn btn-light text-xs" href="#">بیشتر بدانید</a>
		</div>
	</div>

	<div>
		<h2 class="font-semibold">کیف پول الکترونیکی</h2>
		<p class="mt-2 text-sm leading-7">با یک بار شارژ کیف پول آیدی‌پی می توانید انواع خدمات پرداخت قبض, خرید شارژ سیم کارت, خرید بسته های اینترنت, پرداخت کرایه تاکسی و خرید بلیط مترو را بدون ورود به درگاه بانکی و رمز دوم و به آسان ترین حالت ممکن انجام بدهید.</p>
	</div>
	<div>
		<h2 class="font-semibold">درگاه پرداخت شخصی</h2>
		<p class="mt-2 text-sm leading-7">با آیدی‌پی می توانید به راحتی یک <a class="link" href="#">درگاه پرداخت شخصی</a> برای امور مالی خود بسازید و بجای ارسال شماره کارت, شماره حساب یا شماره شبا آدرس آیدی‌پی خود را برای کسانی که قصد پرداخت مبلغی به شما دارند را ارسال کنید و تا سقف 50 میلیون تومان پول جابجا کنید.</p>
	</div>
	<div>
		<h2 class="font-semibold">درگاه پرداخت شخصی و شرکتی</h2>
		<p class="mt-2 text-sm leading-7">با آیدی‌پی می توانید به راحتی یک <a class="link" href="#">درگاه پرداخت شخصی یا شرکتی</a> برای امور مالی خود بسازید و بجای ارسال شماره کارت, شماره حساب یا شماره شبا آدرس آیدی‌پی خود را برای کسانی که قصد پرداخت مبلغی به شما دارند را ارسال کنید و تا سقف 50 میلیون تومان پول جابجا کنید.</p>
	</div>
	<div>
		<h2 class="font-semibold">درگاه پرداخت فروشگاه اینترنتی (وب سرویس)</h2>
		<p class="mt-2 text-sm leading-7">با توجه به روند پیچیده و زمان بر بودن اخذ درگاه بانکی, می‌توانید با استفاده از وب‌سرویس آیدی‌پی در سریع‌ترین زمان ممکن, یک درگاه پرداخت برای وب‌سایت و اپلیکیشن خود را راه‌اندازی کنید.</p>
	</div>
	<div>
		<h2 class="font-semibold">جابه‌جایی پول تا 50 میلیون تومان</h2>
		<p class="mt-2 text-sm leading-7">از طریق درگاه پرداخت آیدی‌پی می توانید تا 50 میلیون تومان برای کسی که درگاه آیدی‌پی خود را فعال کرده است واریز وجه کنید و یا تا 50 میلیون تومان از طریق درگاه آیدی‌پی پول دریافت کنید.</p>
	</div>
	<div>
		<h2 class="font-semibold">ساخت لینک پرداخت (فاکتور پیامکی)</h2>
		<p class="mt-2 text-sm leading-7">با این قابلیت می توانید یک پیامک حاوی اطلاعات پرداخت که شامل لینک پرداخت مستقیم نیز است را با مبلغ دلخواه بسازید و آن را با هدف های مختلف و برای افراد مد نظرتان از طریق پیامک ارسال کنید.</p>
	</div>
	<div>
		<h2 class="font-semibold">ساخت کمپین جمع آوری وجوه</h2>
		<p class="mt-2 text-sm leading-7">برای امور خیریه و یا حمایت از جریان های اجتماعی و... می‌توانید یک <a class="link" href="#">کمپین</a> بسازید و مردم با مراجعه به آن صفحه وجه مورد نظر خود جهت کمک واریز کنند و از تعداد و مبلغ کمک های دیگران نیز باخبر شوند.</p>
	</div>
</section>
