<script>
  import FeaturesItem from './FeaturesItem.svelte'
</script>

<section class="bg-gray-800 text-gray-300">
	<div class="container py-12 px-8 grid gap-8 md:grid-cols-2 xl:grid-cols-3 xl:self-start">
		<div class="grid gap-4 md:col-span-full xl:col-start-1 xl:col-end-2">
			<h2 class="text-xl font-light xl:text-2xl">بـهترین ویژگی‌های آیدی‌پی</h2>
			<p class="text-sm leading-7 text-justify text-gray-400 font-light xl:text-base xl:leading-8">درگاه پرداخت اینترنتی آیدی‌پی, امکان ایجاد و مدیریت تراکنش‌های مالی در بستر وب را به راحتی امکان‌پذیر می‌سازد و با پیاده‌سازی راه‌کارهای هوشمندانه, باعث افزایش تراکنش‌های موفق و سوددهی بیش‌تر می‌شود.</p>
		</div>

    <hr class="bg-gray-700 md:col-span-full xl:hidden">

    <FeaturesItem
      className="xl:col-start-2 xl:col-end-3"
      title="هوشمند, سریع و آسان"
      description="استانداردهای متفاوت آیدی‌پی در بازه‌های زمانی مختلف, باعث می‌شود کاربران به آسانی به بهترین درگاه پرداخت با بالاترین میزان تراکنش‌های موفق به سرعت هدایت شوند."
      bgColor="bg-yellow-800"
    >
      <svg class="fill-yellow-600" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 512 512"><path d="M16 160h441.4L356.7 260.7c-6.25 6.25-6.25 16.38 0 22.62s16.38 6.25 22.62 0l128-128C510.4 152.2 512 148.1 512 144s-1.562-8.188-4.688-11.31l-128-128c-6.25-6.25-16.38-6.25-22.62 0s-6.25 16.38 0 22.62L457.4 128H16c-8.844 0-16 7.2-16 16s7.156 16 16 16zm480 192H54.63l100.7-100.7c6.25-6.25 6.25-16.38 0-22.62s-16.38-6.25-22.62 0l-128 128C1.563 359.8 0 363.9 0 368s1.562 8.188 4.688 11.31l128 128c6.25 6.25 16.38 6.25 22.62 0s6.25-16.38 0-22.62L54.63 384H496c8.844 0 16-7.156 16-16s-7.2-16-16-16z"/></svg>
    </FeaturesItem>
    <FeaturesItem
      className="xl:col-start-3 xl:col-end-4"
      title="ضمانت پرداخت"
      description="درگاه پرداخت آیدی‌پی, تجربه‌ی پرداخت اینترنتی سریع‌تر, امن و مطمئن‌تر را به همه مشتریان خود و کسب‌وکارهای آنلاین هدیه می‌دهد. سریع‌تر از همیشه ادامه دهید..."
      bgColor="bg-sky-800"
    >
      <svg class="fill-sky-600" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 512 512"><path d="M235.3 331.3c-6.2 6.3-16.4 6.3-22.6 0l-56-56c-6.3-6.2-6.3-16.4 0-22.6 6.2-6.3 16.4-6.3 22.6 0l44.7 44.7 100.7-100.7c6.2-6.3 16.4-6.3 22.6 0 6.3 6.2 6.3 16.4 0 22.6l-112 112zM343.1 45.63c33-5.96 68.4 3.8 93.9 29.35 25.6 25.52 35.3 60.92 29.4 93.92 27.5 18.2 45.6 51 45.6 86.2 0 37-18.1 68.9-45.6 88 5.9 33-3.8 68.4-29.4 93.9-25.5 25.6-60.9 35.3-93.9 29.4-19.1 27.5-51 45.6-87.1 45.6-36.1 0-68.9-18.1-87.1-45.6-33 5.9-68.4-3.8-93.92-29.4-25.55-25.5-35.31-60.9-29.35-93.9C18.08 324 0 292.1 0 255.1c0-35.2 18.08-68 45.63-86.2-5.96-33 3.8-68.4 29.35-93.92 25.52-25.55 60.92-35.31 93.92-29.35C187.1 18.08 219.9 0 255.1 0c37 0 68.9 18.08 88 45.63zM184.4 83.08l-12.7-3.88c-25.4-7.8-54.1-1.63-74.09 18.41C77.57 117.6 71.4 146.3 79.2 171.7l3.88 12.7-11.68 6.2C47.93 203 32 227.7 32 255.1c0 29.2 15.93 53 39.4 66.3l11.68 6.2-3.88 12.7c-7.8 25.4-1.63 54 18.41 74.1 19.99 20 48.69 26.2 74.09 18.4l12.7-3.9 6.2 11.7C203 464.1 227.7 480 256 480c28.3 0 52.1-15.9 65.4-39.4l6.2-11.7 12.7 3.9c25.4 7.8 54 1.6 74.1-18.4 20-20.1 26.2-48.7 18.4-74.1l-3.9-12.7 11.7-6.2c23.5-13.3 39.4-37.1 39.4-66.3 0-27.4-15.9-52.1-39.4-64.5l-11.7-6.2 3.9-12.7c7.8-25.4 1.6-54.1-18.4-74.1-20-20.04-48.7-26.2-74.1-18.4l-12.7 3.88-6.2-11.68c-13.3-23.47-37.1-40.3-65.4-40.3-28.3 0-53 16.83-65.4 40.3l-6.2 11.68z"/></svg>
    </FeaturesItem>
    <FeaturesItem
      className="xl:col-start-2 xl:col-end-3"
      title="کم کارمزد ترین"
      description="آیدی‌پی همیشه در تلاش است تا به صرفه‌ترین تراکنش‌ها را برای شما به ارمغان بیاورد. در این راستا, حداقل ۷۰۰ تومان و حداکثر ۳,۰۰۰ تومان کارمزد دریافت خواهد شد."
      bgColor="bg-lime-800"
    >
      <svg class="fill-lime-600" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 512 512"><path d="M160 416H80.37c-17.81 0-33.59-9.156-42.21-24.5-8.406-14.94-8.109-32.63.797-47.28L108.6 229.6l14.02 48.41c2.031 7 8.422 11.56 15.37 11.56a15.71 15.71 0 0 0 4.453-.625c8.482-2.469 13.37-11.34 10.92-19.81l-25.17-86.94C127 178.1 124.3 174.6 120.6 172.6c-3.8-2.1-8.2-2.6-12.2-1.4l-86.94 25.2c-8.49 2.5-13.376 11.4-10.92 19.8 2.453 8.5 11.33 13.5 19.82 10.94l51.31-14.84-70.05 115.3c-14.1 24.69-15.5 54.44-1.344 79.59C24.64 432.8 50.84 448 80.37 448h79.64c8.844 0 15.1-7.156 15.1-16s-6.31-16-15.11-16zm340.4-88.4-38.74-63.78c-4.592-7.5-14.4-9.906-21.98-5.375-7.547 4.594-9.951 14.44-5.359 22l38.74 63.78c8.906 14.66 9.203 32.34.797 47.28C465.2 406.8 449.4 416 431.6 416h-121l36.68-36.69c6.25-6.25 6.25-16.38 0-22.62s-16.37-6.25-22.62 0l-63.99 64c-6.25 6.25-6.25 16.38 0 22.62l63.99 64c3.14 3.09 7.24 4.69 10.44 4.69s8.186-1.562 11.31-4.688c6.25-6.25 6.25-16.38 0-22.62L310.6 448h121c29.53 0 55.72-15.25 70.1-40.81 14.2-25.19 13.7-54.89-1.3-79.59zm-203-272.47 50.37 82.91-45.47-13.19c-8.498-2.5-17.37 2.469-19.82 10.94s2.438 17.34 10.92 19.81l86.92 25.19c1.469.406 2.953.625 4.453.625a15.71 15.71 0 0 0 7.719-2 15.933 15.933 0 0 0 7.654-9.562l25.17-86.94c2.453-8.469-2.438-17.34-10.92-19.81-8.531-2.469-17.37 2.438-19.83 10.94l-15.57 53.78L324.8 38.5C310.1 14.38 284.4 0 256 0s-54.1 14.38-68.8 38.5l-29.8 49.19c-4.594 7.562-2.188 17.41 5.357 22 7.531 4.562 17.4 2.125 21.98-5.375l29.89-49.19C223.4 40.63 238.9 32 256 32s32.6 8.63 41.4 23.13z"/></svg>
    </FeaturesItem>
    <FeaturesItem
      className="xl:col-start-3 xl:col-end-4"
      title="امنیت بالا"
      description="درگاه امن آیدی‌پی, ضمانتی بر امنیت اطلاعات بانکی شما, هنگام پرداخت‌‌های اینترنتی است. مطمئن‌تر از همیشه, پرداخت‌های اینترنتی خود را به آسانی به انجام برسانید."
      bgColor="bg-teal-800"
    >
      <svg class="fill-teal-600" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 512 512"><path d="m466.5 83.71-192-80c-5.875-2.5-12.16-3.703-18.44-3.703S243.5 1.203 237.6 3.703L45.61 83.71C27.73 91.08 16 108.6 16 127.1 16 385.4 205.4 512 255.9 512 305.2 512 496 387.3 496 127.1c0-18.5-11.7-36.02-29.5-43.39zm-2.6 44.59c0 225.3-166.2 351.7-207.8 351.7C213.3 479.1 48 352.2 48 128c0-6.5 3.875-12.25 9.75-14.75l192-80a16.221 16.221 0 0 1 6.258-1.266c2.071 0 4.154.407 6.117 1.266l192 80c9.175 3.85 9.775 12.55 9.775 15.05zm-127.9 53a15.933 15.933 0 0 0-11.31 4.688L229.3 281.4l-42-42c-3.1-3.2-7.2-4.7-11.3-4.7-9.139 0-16 7.473-16 16 0 4.094 1.562 8.188 4.688 11.31l53.34 53.33C221.2 318.4 225.3 320 229.3 320s8.188-1.562 11.31-4.688l106.7-106.7A16.064 16.064 0 0 0 352 197.3c0-8.5-6.9-16-16-16z"/></svg>
    </FeaturesItem>
	</div>
</section>
